# 농업 데이터 정재/가공/분석/모델링 교육

* toc : true
* branch: master
* badges: true
* comments: true
* author: 이강철
* categories: [R]
* published : true
* hide : false

## Introduction

* 이름 : 이강철

* 회사 및 직책 : (주)좋은정보기술 주임

* mail : rkdcjf8232@gmail.com

* 사용언어 : R

[R install](https://iamoverthemoon.tistory.com/64)

* 교육 자료 : R for data science, 논문, ISLR 등등

## 1. 데이터 전처리(tidyverse)

* 데이터 전처리는 전체 분석 프로세스에서 가장 많은 시간이 소요되는 작업

* 또한, 전처리 과정이 잘못 수행될 시에 분석 결과가 과대 또는 과소 해석으로 이루어질 수 있다.

* 실제 분석에서는 R의 벡터, 리스트 형태가 아닌 `csv,xlsx` 등의 파일을 데이터프레임 형태로 읽어들여 분석을 수행하기 때문에 데이터 프레임의 초점을 둘 것임

왜 tidyverse냐?

`1`. 데이터 로드

* tidyverse = dplyr + ggplot2 + $\dots$

* 또한, 데이터 로드 및 전처리 수행시 R의 기존 내장 함수들보다 빠른 속도를 제공한다.

* 아래 데이터는 총 `3,599,999` 개의 데이터로 `약 1.5 GB`의 데이터이다.

[데이터링크](https://www.kaggle.com/datasets/kritanjalijain/amazon-reviews?select=train.csv)

In [15]:
#install.packages("tidyverse")
#install.packages("nycflights13")  # if not installed yet

library(tidyverse)

In [23]:
setwd("C:/Users/git/Desktop")

In [24]:
start <- Sys.time()
d1 <- read.csv("train.csv",encoding = "UTF-8")
end <- Sys.time()

In [25]:
nrow(d1)

[1] 3599999

In [26]:
end-start

Time difference of 30.43872 secs

In [27]:
start <- Sys.time()
d2 <- read_csv("train.csv")
end <- Sys.time()

Rows: 3599999 Columns: 3
-- Column specification ------------------------------------------------------------------------------------------------
Delimiter: ","
chr (2): Stuning even for the non-gamer, This sound track was beautiful! It ...
dbl (1): 2

i Use `spec()` to retrieve the full column specification for this data.
i Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [28]:
end-start

Time difference of 6.747563 secs

### select & fliter

`2` pip(%>%) 연선자

* 단축키 :  ctrl + shift + m

* 위에 단축키를 사용시 데이터셋을 말로 이어말하듯 전처리가 가능하다.

> example 1 : 2013년 NYC 공항 데이터 총 336,776 개의 행, 19개의 열로 구성

In [34]:
library(nycflights13)

In [35]:
glimpse(flights)

Rows: 336,776
Columns: 19
$ year           <int> 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2~
$ month          <int> 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1~
$ day            <int> 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1~
$ dep_time       <int> 517, 533, 542, 544, 554, 554, 555, 557, 557, 558, 558, ~
$ sched_dep_time <int> 515, 529, 540, 545, 600, 558, 600, 600, 600, 600, 600, ~
$ dep_delay      <dbl> 2, 4, 2, -1, -6, -4, -5, -3, -3, -2, -2, -2, -2, -2, -1~
$ arr_time       <int> 830, 850, 923, 1004, 812, 740, 913, 709, 838, 753, 849,~
$ sched_arr_time <int> 819, 830, 850, 1022, 837, 728, 854, 723, 846, 745, 851,~
$ arr_delay      <dbl> 11, 20, 33, -18, -25, 12, 19, -14, -8, 8, -2, -3, 7, -1~
$ carrier        <chr> "UA", "UA", "AA", "B6", "DL", "UA", "B6", "EV", "B6", "~
$ flight         <int> 1545, 1714, 1141, 725, 461, 1696, 507, 5708, 79, 301, 4~
$ tailnum        <chr> "N14228", "N24211", "N619AA", "N804JB", "N668DN", "N394~
$ origin         <chr> "EWR", "LGA", "JFK", "JFK", "LGA", "EWR", "EWR", "LGA",~
$ dest           <chr> "IAH", "IAH", "MIA", "BQN", "ATL", "ORD", "FLL", "IAD",~
$ air_time       <dbl> 227, 227, 160, 183, 116, 150, 158, 53, 140, 138, 149, 1~
$ distance       <dbl> 1400, 1416, 1089, 1576, 762, 719, 1065, 229, 944, 733, ~
$ hour           <dbl> 5, 5, 5, 5, 6, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 6, 6, 6~
$ minute         <dbl> 15, 29, 40, 45, 0, 58, 0, 0, 0, 0, 0, 0, 0, 0, 0, 59, 0~
$ time_hour      <dttm> 2013-01-01 05:00:00, 2013-01-01 05:00:00, 2013-01-01 0~

`-` 원데이터

In [38]:
flights %>% head()

  year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1 2013 1     1   517      515             2         830      819
2 2013 1     1   533      529             4         850      830
3 2013 1     1   542      540             2         923      850
4 2013 1     1   544      545            -1        1004     1022
5 2013 1     1   554      600            -6         812      837
6 2013 1     1   554      558            -4         740      728
  arr_delay carrier flight tailnum origin dest air_time distance hour minute
1  11       UA      1545   N14228  EWR    IAH  227      1400     5    15
2  20       UA      1714   N24211  LGA    IAH  227      1416     5    29
3  33       AA      1141   N619AA  JFK    MIA  160      1089     5    40
4 -18       B6       725   N804JB  JFK    BQN  183      1576     5    45
5 -25       DL       461   N668DN  LGA    ATL  116       762     6     0
6  12       UA      1696   N39463  EWR    ORD  150       719     5    58
  time_hour
1 2013-01-01 05:00:00
2 2013-01-01 05:00:00
3 2013-01-01 05:00:00
4 2013-01-01 05:00:00
5 2013-01-01 06:00:00
6 2013-01-01 05:00:00

철수 : **"아 난 이 데이터의 1번째 열과 5번째 열을 선택하고 싶어"**

In [40]:
flights %>% select(1,5) %>% head()

  year sched_dep_time
1 2013 515
2 2013 529
3 2013 540
4 2013 545
5 2013 600
6 2013 558

영희 : **"난 이 데이터의 `year`, `month`, `day` 열만 보고 싶어"**

In [41]:
flights %>% select(year,month,day) %>% head()

  year month day
1 2013 1     1
2 2013 1     1
3 2013 1     1
4 2013 1     1
5 2013 1     1
6 2013 1     1

강철 : **"근데 난 영희가 고른 데이터들 중  2월과 3월에 해당하는 데이터만 있으면 되"**

In [50]:
flights  %>% 
        select(year,month,day) %>%  
                    filter(month == 2 | month == 3) %>% head()

  year month day
1 2013 2     1
2 2013 2     1
3 2013 2     1
4 2013 2     1
5 2013 2     1
6 2013 2     1

$\divideontimes$ 근데 만약 데이터가 문자형(character) 형태이면 어떻게 필터링을 할 것인가?

> example 2 : iris 데이터, 각 3개 종에 대한 붓꽃 데이터

In [55]:
glimpse(iris)

Rows: 150
Columns: 5
$ Sepal.Length <dbl> 5.1, 4.9, 4.7, 4.6, 5.0, 5.4, 4.6, 5.0, 4.4, 4.9, 5.4, 4.~
$ Sepal.Width  <dbl> 3.5, 3.0, 3.2, 3.1, 3.6, 3.9, 3.4, 3.4, 2.9, 3.1, 3.7, 3.~
$ Petal.Length <dbl> 1.4, 1.4, 1.3, 1.5, 1.4, 1.7, 1.4, 1.5, 1.4, 1.5, 1.5, 1.~
$ Petal.Width  <dbl> 0.2, 0.2, 0.2, 0.2, 0.2, 0.4, 0.3, 0.2, 0.2, 0.1, 0.2, 0.~
$ Species      <fct> setosa, setosa, setosa, setosa, setosa, setosa, setosa, s~

In [57]:
unique(iris$Species)

[1] setosa     versicolor virginica
Levels: setosa versicolor virginica

R 코드 : A %in% c("setosa","versicolor")

수식 표현 : $A \in \{\text{"setosa","versicolor"}\}$

In [64]:
iris %>% filter(Species  
                    %in% c("setosa","versicolor")) %>% sample_n(4)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 6.4          3.2         4.5          1.5         versicolor
2 4.4          3.2         1.3          0.2         setosa
3 4.6          3.4         1.4          0.3         setosa
4 7.0          3.2         4.7          1.4         versicolor

### mutate

`-` 수식이나 문자표현식을 이용해 새로운 변수를 만드는 함수

> example 1 : (Sepal.Length + Sepal.Width) $\div$ 2$\quad\to\quad $ S.LW 변수 생성

In [66]:
iris %>% mutate(S.LW =(Sepal.Length + Sepal.Width) / 2 ) %>% head()

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species S.LW
1 5.1          3.5         1.4          0.2         setosa  4.30
2 4.9          3.0         1.4          0.2         setosa  3.95
3 4.7          3.2         1.3          0.2         setosa  3.95
4 4.6          3.1         1.5          0.2         setosa  3.85
5 5.0          3.6         1.4          0.2         setosa  4.30
6 5.4          3.9         1.7          0.4         setosa  4.65

### groupyby + summarize

* 데이터의 그룹별 요약 통계량을 통해 그룹별 데이터의 형태를 파악할 수 있다.

* 현재 `iris` 데이터의 경우 총 3가지의 종으로 나누어져 있다.

`1` 각 그룹별 빈도수 세기

In [68]:
iris %>% 
        group_by(Species) %>% count()

  Species    n
1 setosa     50
2 versicolor 50
3 virginica  50

`2` 각 그룹별 `Speal.Length` 변수의 평균값과 표준편차 산출

In [74]:
iris %>% group_by(Species) %>% 
                    summarize(sl_mean = mean(Sepal.Length),
                              sl_sd = sd(Sepal.Length))

  Species    sl_mean sl_sd
1 setosa     5.006   0.3524897
2 versicolor 5.936   0.5161711
3 virginica  6.588   0.6358796

`3`. 각 그룹별 `Sepal.Length`변수의 최소$\cdot$최대값과 중앙값 산출

In [94]:
iris %>% group_by(Species) %>% 
                summarize(sl_min = min(Sepal.Length),
                          sl_max = max(Sepal.Length),
                          sl_median = median(Sepal.Length))

  Species    sl_min sl_max sl_median
1 setosa     4.3    5.8    5.0
2 versicolor 4.9    7.0    5.9
3 virginica  4.9    7.9    6.5

### Join

* 보통의 데이터는 한 가지의 데이터 프레임이 아닌 다수의 데이터 프레임을 결합하여 형성한다.

* 이러한 것을 데이터 프레임들을 **"join"** 한다고 하며 이 경우 각 데이터 프레임의 `key` 값을 이용한다.

In [89]:
#collapse-hide
table1 <- tibble(key1 = c("철수","영희","강철","호연"),
          height = c(170,180,185,190))

table1

  key1 height
1 철수 170
2 영희 180
3 강철 185
4 호연 190

In [90]:
#collapse-hide
table2 <- tibble(key2 = c("철수","영희","호연","강철"),
          weight = c(60,70,80,90))
table2

  key2 weight
1 철수 60
2 영희 70
3 호연 80
4 강철 90

In [91]:
table1 %>% left_join(table2, by=c("key1"="key2"))

  key1 height weight
1 철수 170    60
2 영희 180    70
3 강철 185    90
4 호연 190    80

### 결측치 처리

In [99]:
summary(airquality)

     Ozone           Solar.R           Wind             Temp
 Min.   :  1.00   Min.   :  7.0   Min.   : 1.700   Min.   :56.00
 1st Qu.: 18.00   1st Qu.:115.8   1st Qu.: 7.400   1st Qu.:72.00
 Median : 31.50   Median :205.0   Median : 9.700   Median :79.00
 Mean   : 42.13   Mean   :185.9   Mean   : 9.958   Mean   :77.88
 3rd Qu.: 63.25   3rd Qu.:258.8   3rd Qu.:11.500   3rd Qu.:85.00
 Max.   :168.00   Max.   :334.0   Max.   :20.700   Max.   :97.00
 NA's   :37       NA's   :7
     Month            Day
 Min.   :5.000   Min.   : 1.0
 1st Qu.:6.000   1st Qu.: 8.0
 Median :7.000   Median :16.0
 Mean   :6.993   Mean   :15.8
 3rd Qu.:8.000   3rd Qu.:23.0
 Max.   :9.000   Max.   :31.0

`1`. 모든 결측치 제거

In [100]:
air_not_na <- na.omit(airquality)

In [101]:
summary(air_not_na)

     Ozone          Solar.R           Wind            Temp
 Min.   :  1.0   Min.   :  7.0   Min.   : 2.30   Min.   :57.00
 1st Qu.: 18.0   1st Qu.:113.5   1st Qu.: 7.40   1st Qu.:71.00
 Median : 31.0   Median :207.0   Median : 9.70   Median :79.00
 Mean   : 42.1   Mean   :184.8   Mean   : 9.94   Mean   :77.79
 3rd Qu.: 62.0   3rd Qu.:255.5   3rd Qu.:11.50   3rd Qu.:84.50
 Max.   :168.0   Max.   :334.0   Max.   :20.70   Max.   :97.00
     Month            Day
 Min.   :5.000   Min.   : 1.00
 1st Qu.:6.000   1st Qu.: 9.00
 Median :7.000   Median :16.00
 Mean   :7.216   Mean   :15.95
 3rd Qu.:9.000   3rd Qu.:22.50
 Max.   :9.000   Max.   :31.00

`2` 결측치를 다른 값으로 채우기

- 중앙값 대치

In [103]:
#install.packages("DMwR2")
library(DMwR2)

In [104]:
air_mid <- centralImputation(airquality)

In [133]:
#collapse-hide
bind_cols(airquality[is.na(airquality$Ozone),] %>% select(1),air_mid[is.na(airquality$Ozone),] %>% select(1)) %>% head()

New names:
* `Ozone` -> `Ozone...1`
* `Ozone` -> `Ozone...2`

  Ozone...1 Ozone...2
1 NA        31.5
2 NA        31.5
3 NA        31.5
4 NA        31.5
5 NA        31.5
6 NA        31.5

`-` 위 밖에도 중앙값 대치, 평균법 대치가 존재한다.

* KNN 대치법
    * 범주형 자료 : 다수결 법칙에 의거
    * 연속형(수치형) 자료 : 주변 k개의 평균값으로 대체

![](knn결측치대체.png)

In [134]:
air_knn <- knnImputation(airquality,k=5)

In [135]:
#collapse-hide
bind_cols(airquality[is.na(airquality$Ozone),] %>% select(1),air_knn[is.na(airquality$Ozone),] %>% select(1)) %>% head()

New names:
* `Ozone` -> `Ozone...1`
* `Ozone` -> `Ozone...2`

  Ozone...1 Ozone...2
1 NA        16.90152
2 NA        20.87092
3 NA        16.11073
4 NA        21.53301
5 NA        11.27240
6 NA        53.84819